# Pandas -- Data Science

<tr>
<td> <img src = "https://miro.medium.com/max/1400/0*DdYAfo_NsnAeHrur" width="80%" height="80%"/ </td>
<td> <img src = "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/2880px-Pandas_logo.svg.png" width="50%" height="50%"/> </td>
</tr>

**Pandas** is a popular software library for the Python in data manipulation and analysis. It is one of the most important and useful tools in the arsenal of a Data Scientist and a Data Analyst.

**Four steps for business intelligence:**
1. data collection
2. data analysis
3. data visualization
4. decision-making

# Introduction

Install Pandas

In [2]:
#import libraries
import pandas as pd

In [ ]:
#create an example dataset
mydata = { #dataset name
  'cars': ["BMW", "Volvo", "Ford"], #'column name':[data]
  'passings': [3, 7, 2]
} #end dictionary

mydata

In [ ]:
#convert the data into pandas dataframe
mydf = pd.DataFrame(mydata)
mydf

In [ ]:
#display the first row
print(mydf[:1])

In [ ]:
#refer to the row index 0:
print(mydf.loc[0])

In [ ]:
#use a list of indexes:
print(mydf.loc[[0, 1]])

In [ ]:
#instead of using the default index [0....n], name your own index
mydf2 = pd.DataFrame(mydata, index = ["Car1", "Car2", "Car3"])

print(mydf2)

In [ ]:
#refer to the named index:
print(mydf2.loc["Car2"])

In [ ]:
# rename columns
mydf2 = mydf2.rename(columns={'cars': 'Car_brands'})
mydf2.head()

### JSON data format -- Twitter data

Example:https://developer.twitter.com/en/docs/twitter-api/v1/data-dictionary/overview

{
  "created_at": "Thu Apr 06 15:24:15 +0000 2017",
  "id_str": "850006245121695744",
  "text": "1\/ Today we\u2019re sharing our vision for the future of the Twitter API platform!\nhttps:\/\/t.co\/XweGngmxlP",
  "user": {
    "id": 2244994945,
    "name": "Twitter Dev",
    "screen_name": "TwitterDev",
    "location": "Internet",
    "url": "https:\/\/dev.twitter.com\/",
    "description": "Your official source for Twitter Platform news, updates & events. Need technical help? Visit https:\/\/twittercommunity.com\/ \u2328\ufe0f #TapIntoTwitter"
  },
  "place": {   
  },
  "entities": {
    "hashtags": [      
    ],
    "urls": [
      {
        "url": "https:\/\/t.co\/XweGngmxlP",
        "unwound": {
          "url": "https:\/\/cards.twitter.com\/cards\/18ce53wgo4h\/3xo1c",
          "title": "Building the Future of the Twitter API Platform"
        }
      }
    ],
    "user_mentions": [     
    ]
  }
}

In [ ]:
# JSON to Pandas dataframe
json = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

dfjson = pd.DataFrame(json)

dfjson

In [ ]:
#query sepecific columns
print(dfjson[["Duration","Maxpulse"]])

### Parsing JSON Dataset

**“Normalize” semi-structured JSON data into a flat table**

In [10]:
from pandas.io.json import json_normalize

In [ ]:
jsondata2 = [{'state': 'Florida',
      'shortname': 'FL',
       'info': {
            'governor': 'Rick Scott'
         },
#parent node         
              'counties': [{'name': 'Dade', 'population': 12345},
                    {'name': 'Broward', 'population': 40000},
                     {'name': 'Palm Beach', 'population': 60000}]}, 
        {'state': 'Ohio',
        'shortname': 'OH',
          'info': {
              'governor': 'John Kasich'
        },
      'counties': [{'name': 'Summit', 'population': 1234},
                      {'name': 'Cuyahoga', 'population': 1337}]}]

In [ ]:
norm = json_normalize(jsondata2, 'counties', ['state', 'shortname',
                                           ['info', 'governor']])
norm

# Data cleaning

In [15]:
#load nba dataset
nba = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")

nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
import numpy as np
# add one coulmn with random numbers
nba['Add'] = np.random.randint(0,5, size=len(nba))
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Add
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,4
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,1
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,1
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,3
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,2
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,4
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,3
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1

In [7]:
#save the data to csv file
nba.to_csv("nba1.csv")

In [8]:
#remove the index
nba.to_csv("nba2.csv",index=False)

In [18]:
#save the data to excel file
from openpyxl.workbook import Workbook
nba.to_excel("nba.xlsx",
             sheet_name='nba_example', index=False)

In [19]:
#read excel file
readxlsx = pd.read_excel('nba.xlsx',sheet_name='nba_example')
readxlsx

#if you have the following error message, you need to install openpyxl
#ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.
#!pip install openpyxl
#https://anaconda.org/anaconda/openpyxl

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Add
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,4
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,1
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,1
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,3
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,2
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,4
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,3
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1

In [20]:
# in real world, when you facing a very large dataset, you don't have to show them all
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Add
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,4
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,1
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,1
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,3
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,2

In [21]:
# display the entire dataset
pd.set_option('display.max_rows',458)

In [33]:
#nba

In [23]:
# describe your dataset
nba.describe()

           Number         Age      Weight        Salary         Add
count  457.000000  457.000000  457.000000  4.460000e+02  458.000000
mean    17.678337   26.938731  221.522976  4.842684e+06    1.936681
std     15.966090    4.404016   26.368343  5.229238e+06    1.388578
min      0.000000   19.000000  161.000000  3.088800e+04    0.000000
25%      5.000000   24.000000  200.000000  1.044792e+06    1.000000
50%     13.000000   26.000000  220.000000  2.839073e+06    2.000000
75%     25.000000   30.000000  240.000000  6.500000e+06    3.000000
max     99.000000   40.000000  307.000000  2.500000e+07    4.000000

In [24]:
nba.info()
#if you see the following error:
#TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type
#you need to update your Pandas and Numpy, you need to have pandas>=1.0.5
#anaconda prompt: conda update pandas/numpy
#check the version of your pandas: conda list pandas/numpy

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
 9   Add       458 non-null    int64
dtypes: float64(4), int64(1), object(5)
memory usage: 35.9+ KB

## Empty cells / Null values

In [34]:
#remove rows that contains null values (NaN)
new_nba = nba.dropna()
#new_nba

**Note**: By default, the dropna() method returns a new DataFrame, and will not change the original.

In [26]:
new_nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 364 entries, 0 to 456
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      364 non-null    object
 1   Team      364 non-null    object
 2   Number    364 non-null    float64
 3   Position  364 non-null    object
 4   Age       364 non-null    float64
 5   Height    364 non-null    object
 6   Weight    364 non-null    float64
 7   College   364 non-null    object
 8   Salary    364 non-null    float64
 9   Add       364 non-null    int64
dtypes: float64(4), int64(1), object(5)
memory usage: 31.3+ KB

In [27]:
# check how many rows and columns for a dataframe
nba.shape

(458, 10)

If you want to change the original DataFrame, use the inplace = True argument:

In [ ]:
# change in the originial dataframe
#nba.dropna(inplace = True)#drop all the rows contain null values
#nba

In [ ]:
#Replace all empty/null Values with a specific value
#nba.fillna(130000, inplace = True) #hint: get back the original dataframe if you run the previous module
#nba

In [ ]:
#use replace() to replace the null values with 0 for a specific column
#import numpy as np
nba["Salary"].replace(np.nan, 0)

In [31]:
# check unique values for a column 
nba.Team.unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [30]:
# Action 1: Count how many teams use len()
print(len(nba.Team.unique()))

31

In [35]:
# Action 2: how many colleges these football palyers from?
# hints: check the unique values for "College", then count the numbers use len()
print(len(nba.College.unique()))

119

In [38]:
# replace strings with numbers e.g., replace the team "Boston Celtics" to 1 and "Brooklyn Nets" to 2
# change categorical data to numeric
teams = {'Boston Celtics': 1, 'Brooklyn Nets': 2}

nba_replace = nba.replace({'Team': teams})
nba_replace

In [1]:
# Action 3: replace all the team names with numbers 
# Change categorical data to numeric
new_dict = {}
count = 0
for team in nba.Team.unique():
    new_dict[team] = count
    count += 1
nba_replace = nba.replace({'Team': new_dict})
#nba_replace

NameError: name 'nba' is not defined

In [36]:
# select a specific value from a certain column
# find the Team 2 : "Brooklyn Nets" 
# we didn't use inplace = True in the previous module, if you use the "nba" dataset, there is no team names 2
nba_replace.loc[nba_replace['Team'] == 2]

NameError: name 'nba_replace' is not defined

In [ ]:
#Calculate the mean/median value
mean_Sal=nba["Salary"].mean() #.median()
mean_Sal

In [ ]:
# rounded off
round((nba["Salary"].mean()),0)

In [ ]:
# Round to specific decimal 
round((nba["Salary"].mean()),2)

In [ ]:
#Calculate the total salary for all the people in the nba dataset
sum_Sal = nba["Salary"].sum()
sum_Sal

## Texts Cleaning

### Pandas functions for text mining

**S.No**	**Function**	**Description**
1. **lower()**	Converts strings in the Series/Index to lower case.
2. **upper()**	Converts strings in the Series/Index to upper case.
3. **len()**	Computes String length().
4. **strip()**	Helps strip whitespace(including newline) from each string in the Series/index from both the sides.
5. **split(' ')**	Splits each string with the given pattern.
6. **cat(sep=' ')**	Concatenates the series/index elements with given separator.
7. **get_dummies()**	Returns the DataFrame with One-Hot Encoded values.
8. **contains(pattern)**	Returns a Boolean value True for each element if the substring contains in the element, else False.
9. **replace(a,b)**	Replaces the value a with the value b.
10. **repeat(value)**	Repeats each element with specified number of times.
11. **count(pattern)**	Returns count of appearance of pattern in each element.
12. **startswith(pattern)**	Returns true if the element in the Series/Index starts with the pattern.
13. **endswith(pattern)**	Returns true if the element in the Series/Index ends with the pattern.
14. **find(pattern)**	Returns the first position of the first occurrence of the pattern.
15. **findall(pattern)**	Returns a list of all occurrence of the pattern.
16. **swapcase**	Swaps the case lower/upper.
17. **islower()**	Checks whether all characters in each string in the Series/Index in lower case or not. Returns Boolean
18. **isupper()**	Checks whether all characters in each string in the Series/Index in upper case or not. Returns Boolean.
19. **isnumeric()**	Checks whether all characters in each string in the Series/Index are numeric. Returns Boolean.

Source: https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm

In [ ]:
# Action 4: open the sampletweets2022.csv and name it as dftweets
dftweets =

In [ ]:
# Action 5: display the first 5 rows

In [ ]:
# Action 6: display the dataframe basic information

In [ ]:
# display all the columns names
print(dftweets.columns)

In [ ]:
# Action 7: display all the information (hints: set_options())

In [ ]:
# Action 8: show the generate descriptive statistics

In [ ]:
# Action 9: rename columns (hints: 0 (first column) to user; 1 to tweet) (columns={0: 'user', 1: 'tweet'})

In [ ]:
# lower case usernames
dftweets['user'].str.lower()
dftweets['user']

In [ ]:
# above fuction dosen't work
# Lower case tweets with function and Apply
def textLower(x):
    return x.lower()

In [ ]:
dftweets['user'].apply(textLower)

In [ ]:
# upper case usernames
dftweets['user'].str.upper()
dftweets['user']

In [ ]:
# Action 10: write a textUpper fuction and apply it to the usernames

In [ ]:
# save and change it in the original dataset
dftweets['user'] = dftweets['user'].apply(textLower)

In [ ]:
dftweets.head()

In [ ]:
# Get the number of characters in each tweet
dftweets['tweet'].str.len()

In [ ]:
# Action 11: add a new column and name is "count_text" to store the number of character in each tweet

In [ ]:
# find the words starts with... hashtags
dftweets.tweet.str.findall("(?<=#)\w+")

In [ ]:
# Action 12: Create a column named "hashtags"

In [ ]:
#find all the words starting with @ (mentions in Twitter)
dftweets.tweet.str.findall("(?<=@)\w+")

In [ ]:
# Action 13: Create a column named "mentions"

In [ ]:
# Action 14: what is the data type of the values in columns "hashtags" and "mentions"?

In [ ]:
# remove the brackets and keep the string values
dftweets['hash_str'] = dftweets['hashtags'].apply(', '.join)

In [ ]:
# Action 15: remove the brackets and keep the string values for column "mentions"

In [ ]:
# tokenization
dftweets['tweet'].str.split()

In [ ]:
# Determine the number of words in each tweet and create a column "wordcount"
dftweets['wordcount'] = dftweets['tweet'].str.split().str.len()
dftweets.head()

In [ ]:
# How many hashtags per each tweet?
dftweets.tweet.str.count('#')

In [ ]:
# Action 16: Find the number of mentions in each tweet

In [ ]:
# check a string (#KState) in the data using boolean indexing
dftweets.tweet.str.contains("#KState")

In [ ]:
# check a string contains either A or B and view the results
ka = dftweets.tweet.str.contains("#KState|#aggieville")
dftweets[ka]

In [ ]:
# contains both A and B
dftweets[(dftweets['tweet'].str.contains('#KState')) & (dftweets['tweet'].str.contains('#aggieville'))]

In [ ]:
# View retweets only (tweets contains RT)
retweets = dftweets.tweet.str.contains("RT")
dftweets[retweets]

In [ ]:
# View retweets only (tweets start with RT)
dftweets.tweet.str.startswith("RT")

In [ ]:
# view tweets do not contain RT (original tweets)
new_dftweets = dftweets[~dftweets["tweets"].str.contains("RT")]

In [ ]:
# Action 17: remove all the symbols from the tweets hints:re.sub(r"[^a-zA-Z0-9]+",' ',text)

In [ ]:
# same results without library re
dftweets['tweet'].str.replace(r'[^a-zA-Z0-9]+', ' ')

In [ ]:
# Action 18: remove http links hints:replace('http\S+|www.\S+', '')

In [ ]:
# Action 19: remove numbers hints:replace('\d+', '')

In [ ]:
# Action 20: Remove both mentions and hashtags from tweets

In [ ]:
# Action 21: safe the cleaned tweets to a new column and name it "cleaned_tweet"